scripts/searchMessages.yml
config:
  target: "http://localhost:8000/messages"
  phases:
    - duration: 30
      arrivalRate: 50
      rampTo: 200
      name: "Warm up"
    - duration: 120
      arrivalRate: 200
      name: "Max load"
  payload:
    path: "../resources/search-messages-payload.csv"
    fields:
      - "description"
    order: sequence 
scenarios:
  - flow:
    - get:
        url: "/search?description={{ description }}"