scripts/searchMessages.yml
config:
  target: "http://172.21.0.3:8001/messages"
  phases:
    - duration: 120
      arrivalRate: 50
      rampTo: 200
      name: "Warm up"
    - duration: 60
      arrivalRate: 200
      name: "Max load"
  payload:
    path: "./search-messages-payload.csv"
    fields:
      - "description"
    order: sequence 
scenarios:
  - flow:
    - get:
        url: "/search?description={{ description }}"